<a href="https://colab.research.google.com/github/khushimittal0108/adhocnw_machinelearning/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#reading data from a csv file
df=pd.read_csv('com.csv')

In [4]:
#data structure
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [5]:
#to print all the data of csv
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [6]:
#to print top 3 rows 
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [7]:
#to print bottom 3 rows
df.tail(3)

            Name Department      Manager  Salary
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [8]:
# to print particular column
df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [9]:
#for selecting rows and columns
#index location -iloc
df.iloc[0:,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [10]:
#to print particular columns using square brackets
df.iloc[0:,[0,2]]

            Name      Manager
0     Robin Hood          NaN
1  Arsene Wenger   Friar Tuck
2     Friar Tuck   Robin Hood
3    Little John   Robin Hood
4  Sam Allardyce          NaN
5  Dimi Berbatov  Little John

In [11]:
df.iloc[0:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [12]:
#to print salary column
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [13]:
#to print maximum salary 
df['Salary'].max()

250

In [14]:
#to print minimum salary 
df['Salary'].min()

50

In [15]:
#to print mean salary 
df['Salary'].mean()

125.0

In [16]:
#to print total salary 
df['Salary'].sum()

750

In [17]:
#to print all the values 
df.values

array([['Robin Hood', nan, nan, 200],
       ['Arsene Wenger', 'Bar', 'Friar Tuck', 50],
       ['Friar Tuck', 'Foo', 'Robin Hood', 100],
       ['Little John', 'Foo', 'Robin Hood', 100],
       ['Sam Allardyce', nan, nan, 250],
       ['Dimi Berbatov', 'Foo', 'Little John', 50]], dtype=object)

In [18]:
type(df.values)

numpy.ndarray

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
#to print in form of array like numpy
df['Salary'].values

array([200,  50, 100, 100, 250,  50])